<a href="https://colab.research.google.com/github/MrT3313/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/DS-Unit-1-Sprint-Challenge-2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Science Unit 1 Sprint Challenge 2

## Data Wrangling

In this Sprint Challenge you will use data from [Gapminder](https://www.gapminder.org/about-gapminder/), a Swedish non-profit co-founded by Hans Rosling. "Gapminder produces free teaching resources making the world understandable based on reliable statistics."
- [Cell phones (total), by country and year](https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--cell_phones_total--by--geo--time.csv)
- [Population (total), by country and year](https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--population_total--by--geo--time.csv)
- [Geo country codes](https://github.com/open-numbers/ddf--gapminder--systema_globalis/blob/master/ddf--entities--geo--country.csv)

These two links have everything you need to successfully complete the Sprint Challenge!
- [Pandas documentation: Working with Text Data](https://pandas.pydata.org/pandas-docs/stable/text.html]) (one question)
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf) (everything else)

## Part 0. Load data

You don't need to add or change anything here. Just run this cell and it loads the data for you, into three dataframes.

In [0]:
import pandas as pd

# ADDED
import matplotlib.pyplot as plt
%matplotlib inline

cell_phones = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--cell_phones_total--by--geo--time.csv')

population = pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--datapoints--population_total--by--geo--time.csv')

geo_country_codes = (pd.read_csv('https://raw.githubusercontent.com/open-numbers/ddf--gapminder--systema_globalis/master/ddf--entities--geo--country.csv')
                       .rename(columns={'country': 'geo', 'name': 'country'}))

## Part 1. Join data

First, join the `cell_phones` and `population` dataframes (with an inner join on `geo` and `time`).

The resulting dataframe's shape should be: (8590, 4)

In [21]:
# INITIAL DATA EXPLORATION #
print(cell_phones.shape)
cell_phones.head()

(9215, 3)

   geo  time  cell_phones_total
0  abw  1960                0.0
1  abw  1965                0.0
2  abw  1970                0.0
3  abw  1975                0.0
4  abw  1976                0.0

In [3]:
# INITIAL DATA EXPLORATION #
print(population.shape)
population.head()

(59297, 3)

   geo  time  population_total
0  afg  1800           3280000
1  afg  1801           3280000
2  afg  1802           3280000
3  afg  1803           3280000
4  afg  1804           3280000

## Part 1 Answer - V1

In [4]:
# Resulting Shape Should = (8590, 4)

df = pd.merge(cell_phones, population)
print(df.shape)
df.head()

(8590, 4)

   geo  time  cell_phones_total  population_total
0  afg  1960                0.0           8996351
1  afg  1965                0.0           9938414
2  afg  1970                0.0          11126123
3  afg  1975                0.0          12590286
4  afg  1976                0.0          12840299

Then, select the `geo` and `country` columns from the `geo_country_codes` dataframe, and join with your population and cell phone data.

The resulting dataframe's shape should be: (8590, 5)

In [5]:
geo_codes_columns = ['geo', 'country']

final = pd.merge(df, geo_country_codes[geo_codes_columns], how='inner', on='geo')
print(final.shape)
final.head()

(8590, 5)

   geo  time  cell_phones_total  population_total      country
0  afg  1960                0.0           8996351  Afghanistan
1  afg  1965                0.0           9938414  Afghanistan
2  afg  1970                0.0          11126123  Afghanistan
3  afg  1975                0.0          12590286  Afghanistan
4  afg  1976                0.0          12840299  Afghanistan

## Part 2. Answers

Calculate the number of cell phones per person, and add this column onto your dataframe.

(You've calculated correctly if you get 1.220 cell phones per person in the United States in 2017.)

In [6]:
final['cellPhones_perPerson'] = final['cell_phones_total'] / final['population_total']

print(final.shape)
final.head()

(8590, 6)

   geo  time  ...      country  cellPhones_perPerson
0  afg  1960  ...  Afghanistan                   0.0
1  afg  1965  ...  Afghanistan                   0.0
2  afg  1970  ...  Afghanistan                   0.0
3  afg  1975  ...  Afghanistan                   0.0
4  afg  1976  ...  Afghanistan                   0.0

[5 rows x 6 columns]

In [7]:
final.loc[(final['time'] == 2017) & (final['country'] == 'United States')]

      geo  time  ...        country  cellPhones_perPerson
8134  usa  2017  ...  United States              1.220125

[1 rows x 6 columns]

Modify the `geo` column to make the geo codes uppercase instead of lowercase.

In [8]:
final['geo'] = final['geo'].str.upper()

print(final.shape)
final.head()

(8590, 6)

   geo  time  ...      country  cellPhones_perPerson
0  AFG  1960  ...  Afghanistan                   0.0
1  AFG  1965  ...  Afghanistan                   0.0
2  AFG  1970  ...  Afghanistan                   0.0
3  AFG  1975  ...  Afghanistan                   0.0
4  AFG  1976  ...  Afghanistan                   0.0

[5 rows x 6 columns]

## Part 3. Answers

Use the describe function, to describe your dataframe's numeric columns, and then its non-numeric columns.

(You'll see the time period ranges from 1960 to 2017, and there are 195 unique countries represented.)

In [9]:
final.describe()

              time  cell_phones_total  population_total  cellPhones_perPerson
count  8590.000000       8.590000e+03      8.590000e+03           8590.000000
mean   1994.193481       9.004950e+06      2.983823e+07              0.279639
std      14.257975       5.573408e+07      1.161284e+08              0.454247
min    1960.000000       0.000000e+00      4.433000e+03              0.000000
25%    1983.000000       0.000000e+00      1.456148e+06              0.000000
50%    1995.000000       6.200000e+03      5.725062e+06              0.001564
75%    2006.000000       1.697652e+06      1.810581e+07              0.461149
max    2017.000000       1.474097e+09      1.409517e+09              2.490243

In [10]:
final.describe(exclude='number')

         geo country
count   8590    8590
unique   195     195
top      JAM  Greece
freq      46      46

In 2017, what were the top 5 countries with the most cell phones total?

Your list of countries should have these totals:

| country | cell phones total |
|:-------:|:-----------------:|
|    ?    |     1,474,097,000 |
|    ?    |     1,168,902,277 |
|    ?    |       458,923,202 |
|    ?    |       395,881,000 |
|    ?    |       236,488,548 |

In [0]:
# This optional code formats float numbers with comma separators
pd.options.display.float_format = '{:,}'.format

In [12]:
# Filter
top_2017 = final.loc[final['time']==2017]
print(top_2017['cell_phones_total'].head())

# Sort
top_2017_sorted = top_2017.sort_values(by=['time', 'cell_phones_total'], ascending=False)
print(top_2017_sorted['cell_phones_total'].head())

# Result
result_columns = ['country', 'cell_phones_total']

result = top_2017_sorted[result_columns]
print(result.shape)
result.head()

45    23,929,713.0
91    13,323,952.0
137    3,497,950.0
183       80,337.0
219   19,826,224.0
Name: cell_phones_total, dtype: float64
1496   1,474,097,000.0
3595   1,168,902,277.0
3549     458,923,202.0
8134     395,881,000.0
1084     236,488,548.0
Name: cell_phones_total, dtype: float64
(168, 2)

            country  cell_phones_total
1496          China    1,474,097,000.0
3595          India    1,168,902,277.0
3549      Indonesia      458,923,202.0
8134  United States      395,881,000.0
1084         Brazil      236,488,548.0

2017 was the first year that China had more cell phones than people.

In [13]:
#print(final.head())

china_filter = final.loc[final['country'] == 'China']
#print(china_filter.head())

china_filter_sorted = china_filter.sort_values(by=['cellPhones_perPerson'],ascending=False)
#print(china_filter_sorted.head())

china_morePhones_perPerson_years = china_filter_sorted[(china_filter_sorted['cellPhones_perPerson'] > 1.0 )]
china_lessPhones_perPerson_years = china_filter_sorted[(china_filter_sorted['cellPhones_perPerson'] < 1.0 )]

print(china_morePhones_perPerson_years, china_lessPhones_perPerson_years)

# 2017 was the first year that china had more phones than people

      geo  time  ...  country  cellPhones_perPerson
1496  CHN  2017  ...    China    1.0458168186766978

[1 rows x 6 columns]       geo  time  ...  country   cellPhones_perPerson
1495  CHN  2016  ...    China     0.9725213003418065
1493  CHN  2014  ...    China     0.9251732891877361
1494  CHN  2015  ...    China     0.9248087286588194
1492  CHN  2013  ...    China     0.8888624772913624
1491  CHN  2012  ...    China     0.8087231797896388
1490  CHN  2011  ...    China     0.7212191838989495
1489  CHN  2010  ...    China     0.6317336105130495
1488  CHN  2009  ...    China     0.5526452439590929
1487  CHN  2008  ...    China     0.4769694564014336
1486  CHN  2007  ...    China      0.409414865975522
1485  CHN  2006  ...    China     0.3468664200998914
1484  CHN  2005  ...    China     0.2976687407394673
1483  CHN  2004  ...    China      0.254811335251777
1482  CHN  2003  ...    China     0.2066477270853984
1481  CHN  2002  ...    China     0.1586305340101782
1480  CHN  2001  ...    China    0.11218202529934891
1479  CHN  2000  ...    China    0.06644332016569496
1478  CHN  1999  ...    China    0.03394681871590201
1477  CHN  1998  ...    China   0.018827693383494954
1476  CHN  1997  ...    China   0.010510163695231672
1475  CHN  1996  ...    China   0.005482481399497835
1474  CHN  1995  ...    China   0.002926754510938418
1473  CHN  1994  ...    China  0.0012758423868969712
1472  CHN  1993  ...    China  0.0005241843143031562
1471  CHN  1992  ...    China 0.00014696214842247426
1470  CHN  1991  ...    China  3.998037234828082e-05
1469  CHN  1990  ...    China 1.5624610856012716e-05
1468  CHN  1989  ...    China  8.499731182239687e-06
1467  CHN  1988  ...    China 2.8485266749172663e-06
1466  CHN  1987  ...    China  6.298692690585337e-07
1452  CHN  1965  ...    China                    0.0
1458  CHN  1979  ...    China                    0.0
1453  CHN  1970  ...    China                    0.0
1454  CHN  1975  ...    China                    0.0
1455  CHN  1976  ...    China                    0.0
1456  CHN  1977  ...    China                    0.0
1457  CHN  1978  ...    China                    0.0
1463  CHN  1984  ...    China                    0.0
1459  CHN  1980  ...    China                    0.0
1460  CHN  1981  ...    China                    0.0
1461  CHN  1982  ...    China                    0.0
1462  CHN  1983  ...    China                    0.0
1464  CHN  1985  ...    China                    0.0
1465  CHN  1986  ...    China                    0.0
1451  CHN  1960  ...    China                    0.0

[45 rows x 6 columns]

What was the first year that the USA had more cell phones than people?

In [14]:
#print(final.head())

usa_filter = final.loc[final['country'] == 'United States']
#print(china_filter.head())

usa_filter_sorted = usa_filter.sort_values(by=['cellPhones_perPerson'],ascending=False)
#print(china_filter_sorted.head())

usa_morePhones_perPerson_years = usa_filter_sorted[(usa_filter_sorted['cellPhones_perPerson'] > 1.0 )]
usa_lessPhones_perPerson_years = usa_filter_sorted[(usa_filter_sorted['cellPhones_perPerson'] < 1.0 )]

print(usa_morePhones_perPerson_years, usa_lessPhones_perPerson_years)

# 2014 was the first year that the United States had more phones than people

      geo  time  ...        country  cellPhones_perPerson
8133  USA  2016  ...  United States     1.228758722948959
8134  USA  2017  ...  United States    1.2201246847283354
8132  USA  2015  ...  United States    1.1949739048796058
8131  USA  2014  ...  United States     1.118914031833164

[4 rows x 6 columns]       geo  time  ...        country  cellPhones_perPerson
8130  USA  2013  ...  United States    0.9846652501340288
8129  USA  2012  ...  United States    0.9728807457559626
8128  USA  2011  ...  United States    0.9561250192584747
8127  USA  2010  ...  United States    0.9237840688710478
8126  USA  2009  ...  United States    0.8961260458264333
8125  USA  2008  ...  United States    0.8613129084629373
8124  USA  2007  ...  United States    0.8293546295279024
8123  USA  2006  ...  United States    0.7709164231374367
8122  USA  2005  ...  United States    0.6902054837276331
8121  USA  2004  ...  United States    0.6317748925952943
8120  USA  2003  ...  United States    0.5538679308699229
8119  USA  2002  ...  United States    0.4932056452902494
8118  USA  2001  ...  United States   0.45111083515532086
8117  USA  2000  ...  United States    0.3882436784845066
8116  USA  1999  ...  United States   0.30856451408807795
8115  USA  1998  ...  United States   0.25117466499363805
8114  USA  1997  ...  United States   0.20325198065731348
8113  USA  1996  ...  United States   0.16384832955104026
8112  USA  1995  ...  United States   0.12717687036278622
8111  USA  1994  ...  United States   0.09185612070227213
8110  USA  1993  ...  United States   0.06157006979450434
8109  USA  1992  ...  United States  0.042853252624010636
8108  USA  1991  ...  United States   0.02963880131237587
8107  USA  1990  ...  United States   0.02092050863669834
8106  USA  1989  ...  United States   0.01402942420624947
8105  USA  1988  ...  United States  0.008353291723887707
8104  USA  1987  ...  United States  0.005015650510093476
8103  USA  1986  ...  United States 0.0028047222831313516
8102  USA  1985  ...  United States 0.0014127031793991398
8101  USA  1984  ...  United States 0.0003839481811462992
8097  USA  1977  ...  United States                   0.0
8094  USA  1970  ...  United States                   0.0
8095  USA  1975  ...  United States                   0.0
8096  USA  1976  ...  United States                   0.0
8093  USA  1965  ...  United States                   0.0
8098  USA  1978  ...  United States                   0.0
8099  USA  1979  ...  United States                   0.0
8100  USA  1980  ...  United States                   0.0
8092  USA  1960  ...  United States                   0.0

[39 rows x 6 columns]

In [15]:

final_sorted = final.sort_values(by=['time','cellPhones_perPerson'],ascending=False)
#print(final_sorted.head())

total_morePhones_perPerson_years = final_sorted[(final_sorted['cellPhones_perPerson'] > 1.0 )]
total_lessPhones_perPerson_years = final_sorted[(final_sorted['cellPhones_perPerson'] < 1.0 )]

print(total_morePhones_perPerson_years, total_lessPhones_perPerson_years)

# In 2002 Luxembourge & Israel became the first country to have MORE cellphones than people

      geo  time  ...               country  cellPhones_perPerson
3319  HKG  2017  ...      Hong Kong, China     2.490242818521353
219   ARE  2017  ...  United Arab Emirates     2.109140231347495
5056  MDV  2017  ...              Maldives    2.0629340178305413
1860  CRI  2017  ...            Costa Rica    1.8020298142859967
7393  SYC  2017  ...            Seychelles    1.7657515015252752
7576  THA  2017  ...              Thailand    1.7603473056742354
3549  IDN  2017  ...             Indonesia     1.738402230172827
442   AUT  2017  ...               Austria    1.7084792282666967
5335  MNE  2017  ...            Montenegro    1.6609545917069448
8497  ZAF  2017  ...          South Africa     1.619937977849242
810   BHR  2017  ...               Bahrain     1.584150037786818
6636  RUS  2017  ...                Russia    1.5788753483112417
6978  SLV  2017  ...           El Salvador     1.565132655142726
4734  LTU  2017  ...             Lithuania     1.508955308053117
6058  OMN  2017  ...                  Oman    1.4977389112177009
7773  TTO  2017  ...   Trinidad and Tobago    1.4831640646398248
6544  QAT  2017  ...                 Qatar     1.482946607906681
6844  SGP  2017  ...             Singapore    1.4824016911304636
8091  URY  2017  ...               Uruguay    1.4746710060027481
2863  GEO  2017  ...               Georgia    1.4648608495624174
6150  PAN  2017  ...                Panama     1.458463855958163
4036  KAZ  2017  ...            Kazakhstan    1.4542009642781162
2496  EST  2017  ...               Estonia    1.4541680410985682
5519  MUS  2017  ...             Mauritius     1.453991580365146
1267  BWA  2017  ...              Botswana    1.4140786966309589
3853  ITA  2017  ...                 Italy     1.412932686881211
7164  SUR  2017  ...              Suriname    1.4126165686312793
265   ARG  2017  ...             Argentina    1.3981460024850105
4261  KNA  2017  ...   St. Kitts and Nevis    1.3890685698798446
4780  LUX  2017  ...            Luxembourg    1.3608590208327977
...   ...   ...  ...                   ...                   ...
2125  DMA  2006  ...              Dominica    1.0097871679353736
3768  ISL  2006  ...               Iceland    1.0073199701062296
3400  HRV  2006  ...               Croatia     1.005605739493843
4722  LTU  2005  ...             Lithuania    1.3017700221155584
3307  HKG  2005  ...      Hong Kong, China     1.251399250793928
3841  ITA  2005  ...                 Italy    1.2158109910775967
3795  ISR  2005  ...                Israel    1.1747743818312062
1986  CZE  2005  ...        Czech Republic    1.1479504738464226
4768  LUX  2005  ...            Luxembourg    1.1139213964642825
2805  GBR  2005  ...        United Kingdom     1.086004149435546
6426  PRT  2005  ...              Portugal    1.0834386818583073
2484  EST  2005  ...               Estonia    1.0661322113114908
430   AUT  2005  ...               Austria    1.0498385562751025
4249  KNA  2005  ...   St. Kitts and Nevis    1.0491452551891547
5873  NOR  2005  ...                Norway    1.0263556577160171
3629  IRL  2005  ...               Ireland    1.0135350845732127
7290  SWE  2005  ...                Sweden    1.0072330707896546
2169  DNK  2005  ...               Denmark    1.0050729457281127
2576  FIN  2005  ...               Finland    1.0021055625986062
3306  HKG  2004  ...      Hong Kong, China    1.2074739985332072
3794  ISR  2004  ...                Israel    1.1164241986993932
3840  ITA  2004  ...                 Italy     1.072746688315578
1985  CZE  2004  ...        Czech Republic    1.0530327741413283
4767  LUX  2004  ...            Luxembourg    1.0402395649585343
6425  PRT  2004  ...              Portugal    1.0040682854957719
4766  LUX  2003  ...            Luxembourg     1.204948560544753
3305  HKG  2003  ...      Hong Kong, China    1.0835422143019218
3793  ISR  2003  ...                Israel    1.0423414749999174
4765  LUX  2002  ...            Luxembourg     1.065973145589846
3792  ISR  2002  ...                Israel     1.009732365166842

[1044 rows x 6 columns]       geo  time  ...                         country  cellPhones_perPerson
1952  CYP  2017  ...                          Cyprus     0.997668604409644
6802  SEN  2017  ...                         Senegal    0.9941831102950449
1038  BOL  2017  ...                         Bolivia     0.992003329834594
4575  LCA  2017  ...                       St. Lucia    0.9879783498467939
7064  SRB  2017  ...                          Serbia    0.9813810793242853
901   BIH  2017  ...          Bosnia and Herzegovina    0.9809148344590288
7863  TUR  2017  ...                          Turkey    0.9635290201178971
1676  COG  2017  ...                     Congo, Rep.    0.9610796939599867
672   BFA  2017  ...                    Burkina Faso    0.9350293241701749
5473  MRT  2017  ...                      Mauritania    0.9217166072724574
1221  BTN  2017  ...                          Bhutan     0.904673047634378
4964  MDA  2017  ...                         Moldova    0.9041659631734899
5321  MMR  2017  ...                         Myanmar    0.8984575761539465
855   BHS  2017  ...                         Bahamas    0.8942207248565235
3365  HND  2017  ...                        Honduras    0.8886604921475474
5102  MEX  2017  ...                          Mexico    0.8851342698988217
718   BGD  2017  ...                      Bangladesh    0.8812405928761015
3595  IND  2017  ...                           India    0.8728491809526382
3733  IRQ  2017  ...                            Iraq    0.8709509785309941
4082  KEN  2017  ...                           Kenya    0.8614733980549081
1358  CAN  2017  ...                          Canada     0.858956669605252
7439  SYR  2017  ...                           Syria    0.8566017006800487
8589  ZWE  2017  ...                        Zimbabwe    0.8525218295278666
4918  MCO  2017  ...                          Monaco    0.8522548132833699
7118  STP  2017  ...           Sao Tome and Principe    0.8498436330000441
6506  PSE  2017  ...                       Palestine    0.8403972667436743
2316  ECU  2017  ...                         Ecuador    0.8349883048625137
3273  GUY  2017  ...                          Guyana    0.8268979339443266
8363  VUT  2017  ...                         Vanuatu    0.8254152126381026
1588  CMR  2017  ...                        Cameroon    0.8192504637638899
...   ...   ...  ...                             ...                   ...
7211  SVN  1960  ...                        Slovenia                   0.0
7257  SWE  1960  ...                          Sweden                   0.0
7303  SWZ  1960  ...                       Swaziland                   0.0
7348  SYC  1960  ...                      Seychelles                   0.0
7394  SYR  1960  ...                           Syria                   0.0
7440  TCD  1960  ...                            Chad                   0.0
7485  TGO  1960  ...                            Togo                   0.0
7531  THA  1960  ...                        Thailand                   0.0
7577  TJK  1960  ...                      Tajikistan                   0.0
7622  TKM  1960  ...                    Turkmenistan                   0.0
7683  TON  1960  ...                           Tonga                   0.0
7728  TTO  1960  ...             Trinidad and Tobago                   0.0
7774  TUN  1960  ...                         Tunisia                   0.0
7818  TUR  1960  ...                          Turkey                   0.0
7864  TUV  1960  ...                          Tuvalu                   0.0
7908  TZA  1960  ...                        Tanzania                   0.0
7954  UGA  1960  ...                          Uganda                   0.0
8000  UKR  1960  ...                         Ukraine                   0.0
8046  URY  1960  ...                         Uruguay                   0.0
8092  USA  1960  ...                   United States                   0.0
8135  UZB  1960  ...                      Uzbekistan                   0.0
8181  VCT  1960  ...  St. Vincent and the Grenadines                   0.0
8226  VEN  1960  ...                       Venezuela                   0.0
8272  VNM  1960  ...                         Vietnam                   0.0
8318  VUT  1960  ...                         Vanuatu                   0.0
8364  WSM  1960  ...                           Samoa                   0.0
8407  YEM  1960  ...                           Yemen                   0.0
8452  ZAF  1960  ...                    South Africa                   0.0
8498  ZMB  1960  ...                          Zambia                   0.0
8544  ZWE  1960  ...                        Zimbabwe                   0.0

[7546 rows x 6 columns]

## Part 4. Reshape data

Create a pivot table:
- Columns: Years 20072017
- Rows: China, India, United States, Indonesia, Brazil (order doesn't matter)
- Values: Cell Phones Total

The table's shape should be: (5, 11)

In [16]:
years_list = list(range(2007, 2018))
years_list

[2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017]

In [17]:
country_list = ['China', 'India', 'United States', 'Indonesia', 'Brazil']
country_list

['China', 'India', 'United States', 'Indonesia', 'Brazil']

In [18]:
subset = final[final['time'].isin(years_list)]
subset = subset[subset['country'].isin(country_list)]

pivot_table_phoneTotals = pd.pivot(subset, values='cell_phones_total', index='country', columns='time') 

print(pivot_table_phoneTotals.shape)
pivot_table_phoneTotals

(5, 11)

time                   2007          2008  ...            2016            2017
country                                    ...
Brazil        120,980,103.0 150,641,403.0  ...   244,067,356.0   236,488,548.0
China         547,306,000.0 641,245,000.0  ... 1,364,934,000.0 1,474,097,000.0
India         233,620,000.0 346,890,000.0  ... 1,127,809,000.0 1,168,902,277.0
Indonesia      93,386,881.0 140,578,243.0  ...   385,573,398.0   458,923,202.0
United States 249,300,000.0 261,300,000.0  ...   395,881,000.0   395,881,000.0

[5 rows x 11 columns]

In [19]:
pivot_table_phonesPerPerson = pd.pivot(subset, values='cellPhones_perPerson', index='country', columns='time') 

print(pivot_table_phonesPerPerson.shape)
pivot_table_phonesPerPerson

(5, 11)

time                         2007  ...               2017
country                            ...
Brazil         0.6333153580042348  ... 1.1299655683535224
China           0.409414865975522  ... 1.0458168186766978
India         0.19803654773558707  ... 0.8728491809526382
Indonesia     0.40082074468869777  ...  1.738402230172827
United States  0.8293546295279024  ... 1.2201246847283354

[5 rows x 11 columns]

#### OPTIONAL BONUS QUESTION!

Sort these 5 countries, by biggest increase in cell phones from 2007 to 2017.

Which country had 935,282,277 more cell phones in 2017 versus 2007?

In [20]:
pivot_table_phoneTotals['increase'] = pivot_table_phoneTotals[2017] - pivot_table_phoneTotals[2007]

pivot_table_phoneTotals.sort_values(by='increase',ascending=False)

# INDIA

time                   2007          2008  ...            2017      increase
country                                    ...
India         233,620,000.0 346,890,000.0  ... 1,168,902,277.0 935,282,277.0
China         547,306,000.0 641,245,000.0  ... 1,474,097,000.0 926,791,000.0
Indonesia      93,386,881.0 140,578,243.0  ...   458,923,202.0 365,536,321.0
United States 249,300,000.0 261,300,000.0  ...   395,881,000.0 146,581,000.0
Brazil        120,980,103.0 150,641,403.0  ...   236,488,548.0 115,508,445.0

[5 rows x 12 columns]

If you have the time and curiosity, what other questions can you ask and answer with this data?